/**
 * Created by JieLi on 2017/8/14.
 */

import React,{Component} from 'react';
import { Carousel, WhiteSpace, WingBlank } from 'antd-mobile';

import './facePicture.less'

let faceImage = {"60" : "[爱你]","61" : "[拳头]","54" : "[熊猫]","47" : "[威武]","62" : "[差劲]","55" : "[不要]","48" : "[相机]","70" : "[月亮]","63" : "[握手]","49" : "[汽车]","56" : "[ok]","71" : "[太阳]","64" : "[玫瑰]","57" : "[赞]","65" : "[心]","58" : "[勾引]","72" : "[啤酒]","80" : "[手套]","73" : "[萌]","66" : "[伤心]","59" : "[耶]","1" : "[嘻嘻]","67" : "[猪头]","2" : "[哈哈]","74" : "[礼物]","3" : "[喜欢]","81" : "[雪花]","75" : "[互粉]","68" : "[咖啡]","4" : "[晕]","82" : "[雪人]","5" : "[泪]","69" : "[麦克风]","83" : "[帽子]","6" : "[馋嘴]","76" : "[钟]","84" : "[树叶]","7" : "[抓狂]","10" : "[怒]","8" : "[哼]","77" : "[自行车]","78" : "[蛋糕]","9" : "[可爱]","11" : "[汗]","85" : "[足球]","79" : "[围巾]","12" : "[微笑]","13" : "[睡觉]","20" : "[鄙视]","21" : "[挖鼻屎]","14" : "[钱]","15" : "[偷笑]","22" : "[色]","16" : "[酷]","30" : "[右哼哼]","23" : "[鼓掌]","17" : "[衰]","24" : "[悲伤]","31" : "[左哼哼]","32" : "[嘘]","25" : "[思考]","18" : "[吃惊]","40" : "[拜拜]","26" : "[生病]","19" : "[怒骂]","33" : "[委屈]","41" : "[黑线]","34" : "[哈欠]","27" : "[亲亲]","42" : "[强]","28" : "[抱抱]","35" : "[敲打]","43" : "[弱]","29" : "[白眼]","50" : "[飞机]","36" : "[疑问]","51" : "[爱心]","44" : "[给力]","37" : "[挤眼]","45" : "[浮云]","38" : "[害羞]","52" : "[奥特曼]","46" : "[围观]","39" : "[快哭了]","53" : "[兔子]"};
export default class FacePicture extends Component{
    // 构造
    constructor(props) {
        super(props);
        // 初始状态
        this.state = {
            data:[[1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21],[22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42],[43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63],[64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84],[85]]
        };
    }

    render(){
        return(
            <div className="faceAll">
                <Carousel
                    className="my-carousel"
                    autoplay={false}
                    infinite={false}
                    selectedIndex={0}
                    swipeSpeed={35}
                >
                    {this.state.data.map(ii => (
                        <div key={ii}>
                            {this.makeFace(ii,ii)}
                        </div>
                    ))}
                </Carousel>

            </div>
        )
    }

    makeFace(param,i){
        let that = this;
        return(
            param.map(function (data,i) {
                return(
                    <div className="face" key={data} onClick={()=>{that.chooseOneFace(data)}}>
                        <img src={require(`../../images/faces/${data}.png`)}></img>
                    </div>
                )
            })


        )
    }

    chooseOneFace(param){
        // let text = `[em_${param}]`;
        let text = faceImage[param];
        this.props.faceMessage(text)
    }



}